app/controllers/lists_controller.rb

  def index
  	@lists = current_user.lists.all
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 1

  def create
  	@list = current_user.lists.new(params[:list])

  	if @list.save
---
INSERT INTO "lists" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 24 Nov 2012 18:50:52 UTC +00:00], ["name", "Cath"], ["updated_at", Sat, 24 Nov 2012 18:50:52 UTC +00:00], ["user_id", 2]]