app/controllers/sessions_controller.rb

  def create
  	@user = User.login(params[:sessions][:username], params[:sessions][:password])
  	if @user.present?
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'cath.work.one@gmail.com' LIMIT 1