app/controllers/users_controller.rb

  def create
  	@user = User.new(params[:user])
  	if @user.save
---
INSERT INTO "users" ("avatar_file_name", "created_at", "email", "link", "name", "password_digest", "updated_at", "url", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)